[
    {
      "header": "Experience",
      "entries": [
        {
          "image": "/CACI_International_logo.svg",
          "link": "https://www.caci.com/",
          "bgColor": "white",
          "header": "CACI International Inc.",
          "subHeader": "Full Stack Software Engineer",
          "keypoints": [
            "Secured extended contracts and funding for CACI by leading a team of 3 interns on a scheduling and event visualization app for a DoD customer.",
            "Provided code reviews and feedback to interns in an Agile environment to ensure code quality and meet customer requirements.",
            "Created a new contract opportunity for CACI by pioneering a proof of concept app which integrated an external services with a rapidly developing Cyber Operations program.",
            "Communicated with other dev teams and managers to stay informed on architecture, request or clarify app capabilities, and submit bug reports.",
            "Developed an app in an Agile/Scrum environment, which ingested data and integrated with other apps written in Java, Python, and JavaScript. Utilizes SQL stored procedures, functions, triggers, etc. to ensure efficient and strict adherence to the data model required.",
            "Reduced development time and delivered features to customer early by creating a Svelte/SvelteKit web app which parsed a custom GDL language file into valid JSON, and displayed an interactive Echarts graph visualization.",
            "Improved code maintainability by implementing a large suite of unit and integration tests on an existing CACI project using Mocha and Sinon. Wrote Selenium tests to ensure functionality of the frontend.",
            "Supported an R&D contract by creating a suite of Python scripts which reads in a remote PostgreSQL Greenplum database schema and generates randomized queries categorized by runtime complexity, and runs them against the database while gathering performance data.",
            "Implemented Gitlab CI/CD changes to run installation, testing, linting, and documentation generation steps in parallel, cutting pipeline run time and resource usage by ~50%.",
            "Stack: JavaScript, NodeJS, Python, PostgreSQL, Java"
        ],
          "dates": "Feb. 2021 - Present"
        },
        {
          "image": "/UL.png",
          "link": "https://www.lynchburg.edu/",
          "header": "University of Lynchburg",
          "bgColor": "white",
          "round": "full",
          "subHeader": "CS Dept. Linux/Unix Internship",
          "keypoints": [
            "Ensured department Linux machines were up to date with latest security updates.",
            "Maintained department website, including backups, migrations, security, and all site updates.",
            "Wrote scripts in both Bash and Perl which were executed for every new user created on the machine as part of user account management.",
            "Worked as a team with one other intern to carry out any administration tasks set out by the professor each week.",
            "Languages/Tools used: Bash, Linux, Perl, PHP, Python, VirtualBox VM"
          ],
          "dates": "Aug.2019 - Nov. 2020"
        }
      ]
    },
    {
      "header": "Education",
      "entries": [
        {
          "image": "/UL.png",
          "link": "https://www.lynchburg.edu/",
          "bgColor": "white",
          "round": "full",
          "header": "University of Lynchburg",
          "subHeader": "B.S. of Computer Science",
          "dates": "Graduated Nov. 2020"
        }
      ]
    }, 
    {
      "header": "Personal Projects",
      "entries": [
        {
          "header": "Image to ASCII Converter",
          "image": "/react-ascii.png",
          "bgColor": "black",
          "link": "https://brooklynwelsh.github.io/img-to-ascii/",
          "keypoints": [
            "Made with React, NextJS, and TailwindCSS, allows user to scan any static image into ASCII art.",
            "User can scale images for more or less resolution, and control font size.",
            "Offloads image processing to a Web Worker to keep UI responsive.",
            "Image controls (resolution, scaling) are connected to ASCII conversion script using react state/props.",
            "Completely responsive on all screen sizes."
          ]
        },
        {
          "header": "Personal Website",
          "image": "/personal-site.png",
          "keypoints": [
            "Static website generated with NextJS and TailwindCSS.",
            "Hosted with Github Pages."
          ]
        },
        {
          "header": "Crumbled Cakery LLC. Website (In-Progress)",
          "image": "/crumbled-cakery.svg",
          "bgColor": "white",
          "keypoints": [
            "Made with Svelte/Sveltekit, TypeScript, and PostCSS.",
            "Deployed on the edge/serverless with Cloudflare Pages.",
            "Integration with Storyblok headless CMS to allow editing of content by customer.",
            "(Upcoming) Will integrate with payment processors to allow purchases on site.",
            "(Upcoming) Will automatically email receipts to both the customer and the site owner."
          ]
        }

      ]
    }
  ]