[
    {
      "header": "Experience",
      "entries": [
        {
          "image": "/CACI_International_logo.svg",
          "bgColor": "white",
          "header": "CACI International Inc.",
          "subHeader": "Full Stack Software Engineer",
          "keypoints": [
            "Led a team of 3 interns on a scheduling and event visualization app for CACI customer which led to extended contracts and extra funding for the company. Conducted code reviews, made architectural decisions, and implemented key requested features.",
            "Pioneered a proof of concept app which integrated external services and API’s with a rapidly developing internal Cyber Operations program which directly led to more CACI contracts with the DoD customer. Communicated with application dev team leaders to stay informed on architecture, request or clarify app capabilities, and submit bug reports.",
            "",
            "Stack: JavaScript, NodeJS, Python, PostgreSQL, Java"
        ],
          "dates": "Feb. 2021 - Present"
        },
        {
          "image": "/UL.png",
          "bgColor": "white",
          "header": "University of Lynchburg",
          "subHeader": "CS Dept Linux/Unix Internship",
          "keypoints": [
            "Ensured department Linux machines were up to date with latest security updates.",
            "Maintained department website, including backups, migrations, security, and all site updates.",
            "Wrote scripts in both Bash and Perl which were executed for every new user created on the machine as part of user account management.",
            "Worked with in a team with one other intern to carry out any administration tasks set out by professor during the week."
          ],
          "dates": "Aug.2019 - Nov. 2020"
        }
      ]
    },
    {
      "header": "Education",
      "entries": [
        {
          "image": "/UL.png",
          "header": "University of Lynchburg",
          "subHeader": "B.S. of Computer Science",
          "dates": "Aug. 2013 - Nov. 2020"
        }
      ]
    }, 
    {
      "header": "Personal Projects",
      "entries": [
        {
          "header": "Personal Website",
          "description": ""
        }
      ]
    }
  ]